#### Terraform Plan 📝
```

Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.bronze_layer will be created
  + resource "google_storage_bucket" "bronze_layer" {
      + effective_labels            = {
          + "environment" = "dev"
          + "layer"       = "bronze"
          + "managed_by"  = "terraform"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "dev"
          + "layer"       = "bronze"
          + "managed_by"  = "terraform"
        }
      + location                    = "EUROPE-WEST2"
      + name                        = "datalake-dev-bronze"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment" = "dev"
          + "layer"       = "bronze"
          + "managed_by"  = "terraform"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "NEARLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                    = 10
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + send_age_if_zero       = true
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # google_storage_bucket.gold_layer will be created
  + resource "google_storage_bucket" "gold_layer" {
      + effective_labels            = {
          + "environment" = "dev"
          + "layer"       = "gold"
          + "managed_by"  = "terraform"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "dev"
          + "layer"       = "gold"
          + "managed_by"  = "terraform"
        }
      + location                    = "EUROPE-WEST2"
      + name                        = "datalake-dev-gold"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment" = "dev"
          + "layer"       = "gold"
          + "managed_by"  = "terraform"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # google_storage_bucket.silver_layer will be created
  + resource "google_storage_bucket" "silver_layer" {
      + effective_labels            = {
          + "environment" = "dev"
          + "layer"       = "silver"
          + "managed_by"  = "terraform"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "dev"
          + "layer"       = "silver"
          + "managed_by"  = "terraform"
        }
      + location                    = "EUROPE-WEST2"
      + name                        = "datalake-dev-silver"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment" = "dev"
          + "layer"       = "silver"
          + "managed_by"  = "terraform"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bronze_bucket_name = "datalake-dev-bronze"
  + environment        = "dev"
  + gold_bucket_name   = "datalake-dev-gold"
  + silver_bucket_name = "datalake-dev-silver"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
